[
    {
        "author_fullname":"t2_12wviq",
        "id":"a591uf",
        "title":"Megathread: ECA schools shutdown",
        "view_count":null,
        "upvote_ratio":0.95,
        "ups":165,
        "downs":0,
        "comments":[
            {
                "author":"derspiny",
                "parent_id":"a591uf",
                "score":51,
                "timestamp":1544579327.0,
                "id":"ebkq1jb",
                "body":"Fantastic rundown of the situation and options. Thanks for posting this.\n\n> That does not mean you can't individually attempt to transfer to a new school.\n\nConsider changing this to \"Students can still attempt to transfer to a new school on their own.\" for clarity? The double negative sticks out.",
                "length":297,
                "average_word_length":6.378,
                "quoted_text_per_length":0.2323,
                "reading_level":69.99,
                "sentimentScore":0.138,
                "sentiment":"Positive",
                "replies":[
                    {
                        "author":"phneri",
                        "parent_id":"ebkq1jb",
                        "score":34,
                        "timestamp":1544579514.0,
                        "id":"ebkqasg",
                        "body":"...what double negative? I clearly didn't just ninja edit something.",
                        "length":68,
                        "average_word_length":5.3,
                        "quoted_text_per_length":0.0,
                        "reading_level":49.48,
                        "sentimentScore":-0.085,
                        "sentiment":"Negative",
                        "replies":[
                            {
                                "author":"derspiny",
                                "parent_id":"ebkqasg",
                                "score":14,
                                "timestamp":1544579571.0,
                                "id":"ebkqdn9",
                                "body":"Of course not. :D",
                                "length":17,
                                "average_word_length":3.0,
                                "quoted_text_per_length":0.0,
                                "reading_level":118.18,
                                "sentimentScore":0.2553,
                                "sentiment":"Positive",
                                "replies":[]
                            }
                        ]
                    }
                ]
            },
            {
                "author":"Neekosmith",
                "parent_id":"a591uf",
                "score":17,
                "timestamp":1544585192.0,
                "id":"ebkxzwd",
                "body":">Bear in mind, if you successfully transfer you will not be able to discharge your loan debt.\n\n&#x200B;\n\nNot sure this is 100% true.  I was able to discharge $45k in CCi debt years after transferring from there to a state school (and them accepting some of the useless credits).",
                "length":278,
                "average_word_length":5.095,
                "quoted_text_per_length":0.0,
                "reading_level":88.36,
                "sentimentScore":-0.0042,
                "sentiment":"Neutral",
                "replies":[
                    {
                        "author":"Qwerty_Resident",
                        "parent_id":"ebkxzwd",
                        "score":9,
                        "timestamp":1544587915.0,
                        "id":"ebl1rsx",
                        "body":"It depends on the program you're using to discharge the debt.\n\nI'm going through the borrower's defense forgiveness/discharge program currently, which is for when you graduated but your school made false claims/used high pressure sales tactics to get you to enroll when, had you know the claims were falsified, you would not have enrolled; I don't believe that program disqualifies you if you transferred, but it is also typically harder to do (have to give examples of why you wouldn't go, who told you things, etc, and get it evaluated, versus a more-or-less default judgment in the case of a closed school, from what I heard).\n\nNote that I'm not a lawyer, just someone who thought Westwood College sounded like a good idea when I was 19.",
                        "length":740,
                        "average_word_length":6.44,
                        "quoted_text_per_length":0.0,
                        "reading_level":45.46,
                        "sentimentScore":-0.1385,
                        "sentiment":"Negative",
                        "replies":[
                            {
                                "author":"Neekosmith",
                                "parent_id":"ebl1rsx",
                                "score":1,
                                "timestamp":1544593105.0,
                                "id":"ebl8xq8",
                                "body":"that makes sense!  I believe I went with the false claims angle when I applied.  I was honestly surprised they approved it.",
                                "length":123,
                                "average_word_length":5.105,
                                "quoted_text_per_length":0.0,
                                "reading_level":80.99,
                                "sentimentScore":0.2572,
                                "sentiment":"Positive",
                                "replies":[]
                            }
                        ]
                    },
                    {
                        "author":"phneri",
                        "parent_id":"ebkxzwd",
                        "score":3,
                        "timestamp":1544586710.0,
                        "id":"ebl04a5",
                        "body":"It's specifically listed as making one not eligible for discharge under the federal student loan discharge criteria listed [here](https://studentaid.ed.gov/sa/repay-loans/forgiveness-cancellation/closed-school#criteria).",
                        "length":220,
                        "average_word_length":10.765,
                        "quoted_text_per_length":0.0,
                        "reading_level":-57.8,
                        "sentimentScore":0.0,
                        "sentiment":"Neutral",
                        "replies":[]
                    }
                ]
            },
            {
                "author":"areraswen",
                "parent_id":"a591uf",
                "score":7,
                "timestamp":1544588800.0,
                "id":"ebl2zzx",
                "body":"There were a lot of great resources put together by former students of ITT when this happened to them and I'd recommend seeking some of those out and taking a look. One option open to former students who have already graduated but feel defrauded or misled by the school is called the defense to repayment form, but you should only fill this out if you feel ECA seriously misled or tricked you in some way. You are required to provide as much proof as possible backing up your arguments. after received, your student loans will go in to administrative forbearance while they are reviewed.\n\nCurrently people are being placed on 10 year administrative forbearance because it is expected to take years to review all these cases. So be prepared for a long battle.",
                "length":758,
                "average_word_length":6.16,
                "quoted_text_per_length":0.0,
                "reading_level":57.4,
                "sentimentScore":-0.0035,
                "sentiment":"Neutral",
                "replies":[
                    {
                        "author":"phneri",
                        "parent_id":"ebl2zzx",
                        "score":1,
                        "timestamp":1544589344.0,
                        "id":"ebl3qwa",
                        "body":"If you have a link to resources beyond the Dept. of Ed. site I'd be happy to drop them into the post.",
                        "length":101,
                        "average_word_length":3.8,
                        "quoted_text_per_length":0.0,
                        "reading_level":94.15,
                        "sentimentScore":0.1273,
                        "sentiment":"Positive",
                        "replies":[
                            {
                                "author":"areraswen",
                                "parent_id":"ebl3qwa",
                                "score":2,
                                "timestamp":1544592812.0,
                                "id":"ebl8jb1",
                                "body":"Sure, I think \"the debt collective\" is a good student run source that has information regarding disputing federal student loans via the DTR at least. [Source](https://tools.debtcollective.org/defense-to-repayment)",
                                "length":213,
                                "average_word_length":7.167,
                                "quoted_text_per_length":0.0939,
                                "reading_level":19.71,
                                "sentimentScore":0.0,
                                "sentiment":"Neutral",
                                "replies":[]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "author_fullname":"t2_2ph36hsf",
        "id":"a59vck",
        "title":"(UPDATE) NSW Australia. Last month a friend began to cross a flooded river in his car with me in it. I jumped out because I'd been caught on a flooded causeway before. I now have a letter from his lawyer asking for damages because the car was washed off the causeway and written off.",
        "view_count":null,
        "upvote_ratio":0.94,
        "ups":20970,
        "downs":0,
        "comments":[
            {
                "author":"LocationBot",
                "parent_id":"a59vck",
                "score":1,
                "timestamp":1544590924.0,
                "id":"ebl5y9v",
                "body":"The r/legaladvice community would like to welcome our guests from r/all and/or r/popular. We are glad you are visiting. There are a few things you should know before you post here:\r\n\r\n**We lock update posts that do not contain additional questions**. There are two reasons for this. First, this is a forum for legal advice and if none is sought, none will be offered. Second, those posts were moderating nightmares filled with off topic ranting and pointless arguments. We welcome update posts - particularly when a poster reports that they used our advice successfully. Even when they are locked in r/legaladvice there is almost always a discussion of the update in r/bestoflegaladvice for your popcorn needs.\r\n\r\n**Nothing here constitutes the formation of an attorney/client relationship**. This is not a substitute for an informed local attorney. At best, the advice herein assists the posters in taking the first step toward resolving their legal issue.  \r\n\r\n**We are not a popcorn sub**. We remove posts and ban posters who do not participate in good faith. We lock posts that meander off topic, devolve into pointless bickering, or result in too many reports to the mods. This is not to say that there isn't entertainment to be found here, indeed that is why most of us became involved in the law. It is fun. And when justice results, it is rewarding as well. \r\n\r\n**Our rules are in the sidebar to your right**. They are available in detail [here](https://np.reddit.com/r/legaladvice/comments/3jm6u2/the_law_of_the_land_please_read_before/) and our wiki is [here](https://np.reddit.com/r/legaladvice/wiki/index). For those of you who want more popcorn and fewer vegetables we invite you to visit our sister subs /r/bestoflegaladvice and /r/legaladviceofftopic. \r\n\r\n**Shitposting and brigading will earn you a permanent ban**. We respond to the situation at hand and the laws that apply.  This is not the place to grind your political axe or talk about what you think the law should be. If you want to change the law, get involved in local politics. \r\n\r\n**Personal anecdotes are not useful**. This is not the place to talk about how once your sister's roommate got out of a ticket by doing X. The fact that you have an anecdotal counterexample is not proof that the advice offered is wrong. \r\n\r\n**This is legal advice, not moral advice**. Sometimes we have posts on hot button issues such as abortion, child custody, rape, racial prejudice, sexism, and so on. People come here to learn about their legal options. Advice relating to their immortal souls can be found elsewhere on reddit, online, and at local mosques, churches, temples, and philosophy departments. Sometimes, however, legal advice is indistinguishable from life advice.\r\n\r\nThank you for visiting our sub. We hope you enjoy your time here and consider subscribing.\r\n\r\n\r\n---\r\nLocationBot 4.31977192 | [Report Issues](https://www.reddit.com/r/locationbot)",
                "length":2923,
                "average_word_length":9.624,
                "quoted_text_per_length":0.0,
                "reading_level":67.15,
                "sentimentScore":0.1184,
                "sentiment":"Positive",
                "replies":[]
            },
            {
                "author":"AutoModerator",
                "parent_id":"a59vck",
                "score":1,
                "timestamp":1544584206.0,
                "id":"ebkwnav",
                "body":"Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  This is a forum for legal advice and if none is sought, none will be offered.   If, however, your post also contains a new question, please [message the moderators](https://www.reddit.com/message/compose/?to=/r/legaladvice&subject=Re-approve%20my%20comment&message=https://www.reddit.com/r/legaladvice/comments/a59vck/update_nsw_australia_last_month_a_friend_began_to/%20\\(please%20leave%20this%20so%20we%20can%20reference%20your%20comment\\)) for a review. \n\nFeel free to start or join in the conversation about this update in either /r/bestoflegaladvice or /r/legaladviceofftopic.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*",
                "length":894,
                "average_word_length":10.582,
                "quoted_text_per_length":0.0,
                "reading_level":10.26,
                "sentimentScore":0.1921,
                "sentiment":"Positive",
                "replies":[]
            }
        ]
    }
]